[
    {
        "category": "Продуктивные животные",
        "subcategory": "Мелкий рогатый скот",
        "description": "В современном информационном обществе интернет стал одним из основных способов покупки товаров. Онлайн-магазины предлагают широкий выбор товаров, удобную навигацию по каталогу, а также возможность оформить покупку в несколько кликов.\r\nАктуальность темы «Проектирование клиент-серверной системы с мобильным приложением заказа продуктов из супермаркета \"Гурман\"» обуславливается ростом популярности онлайн-покупок: в последние годы все больше людей предпочитают делать покупки онлайн и с мобильных приложений. Кроме того, супермаркеты имеют дело с большим количеством товаров, запасы которых постоянно меняются, а потому подобная система позволит отслеживать запасы товара как потенциальным покупателям, так и работникам физической организации.\r\nЦелью данного исследования является разработка клиент-серверной системы с мобильным приложением супермаркета, которая удовлетворяет высоким стандартам качества и безопасности, обеспечивая клиентам доступ к обширному и удобному каталогу и предоставляя интуитивный способ оформления заказа.\r\nЗадачи исследования включают в себя:\r\n-    Анализ существующих клиент-серверных систем с мобильным приложением супермаркетов и выявление их характеристик;\r\n-    Проектирование архитектуры и функциональных возможностей клиент-серверной системы супермаркета;\r\n-    Разработка прототипа системы с учетом требований безопасности и удобства использования;\r\n-    Оценка производительности и надежности системы;\r\n-    Оценка удовлетворенности клиентов и сбор обратной связи.\r\nОбъектом исследования являются клиент-серверные системы магазинов супермаркетов, а предметом исследования - проектирование и разработка такой системы. Для достижения целей и задач работы будут использованы методы анализа существующих решений, проектирования информационных систем, разработки программного обеспечения, а также методы оценки качества и производительности.\r\n",
        "filename": "Документ1.pdf",
        "upload_date": "2024-07-07 00:03:31"
    },
    {
        "category": "Корма",
        "subcategory": "subcategory4",
        "description": "хуй\r\n",
        "filename": "090304_19И0209_Лютый Д.А.docx",
        "upload_date": "2024-07-07 10:45:22"
    }
]